---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidCropAreaSketch
source: html/20d07a0e-e05b-b71b-1e9c-33828a5cff1a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidCropAreaSketch Property

Crop area sketch can either be empty or include one closed, not self-intersecting loop.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidCropAreaSketch { get; }
```